tap "homebrew/bundle"
tap "homebrew/services"
tap "shivammathur/php"
brew "pycparser"
brew "cffi"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "php", link: false
brew "composer"
brew "diff-so-fancy"
brew "fd"
brew "fzf"
brew "git"
brew "handbrake"
brew "htop"
brew "httpie"
brew "jq"
brew "libvpx"
brew "mackup"
brew "mas"
brew "midnight-commander"
brew "ncdu"
brew "nvm"
brew "openshift-cli"
brew "php@8.1"
brew "php@8.2", link: true
brew "prettyping"
brew "pv"
brew "pyenv"
brew "rename"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "stockfish"
brew "tldr"
brew "tree"
brew "vim"
brew "webkit2png"
brew "wget"
brew "youtube-dl"
brew "shivammathur/php/php@7.0"
brew "shivammathur/php/php@7.1"
brew "shivammathur/php/php@7.2"
brew "shivammathur/php/php@7.3"
brew "shivammathur/php/php@7.4"
brew "shivammathur/php/php@8.0"
cask "alfred"
cask "android-file-transfer"
cask "cyberghost-vpn"
cask "discord"
cask "dropbox"
cask "firefox"
cask "flixtools"
cask "google-chrome"
cask "google-drive"
cask "insomnia"
cask "iterm2"
cask "jdownloader"
cask "keepingyouawake"
cask "microsoft-edge"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "provisionql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookapk"
cask "rapidapi"
cask "rectangle"
cask "sequel-ace"
cask "skype"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "suspicious-package"
cask "tableplus"
cask "telegram"
cask "transmission"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
mas "Microsoft OneNote", id: 784801555
mas "Microsoft To Do", id: 1274495053
mas "Stockfish", id: 801463932
mas "The Unarchiver", id: 425424353
